DataProcessors/ОбновлениеИнформационнойБазы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ОбновлениеИнформационнойБазы</Name>
			<Comment>Обновление информационной базы</Comment>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ПорядокЗакрытияБалансовыхСтатей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ПорядокЗакрытияБалансовыхСтатей</Name>
			<Comment>Порядок распределения статей доходов и расходов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Comment>Порядок закрытия статьи</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Статья</Name>
					<Comment>Статья</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/АдресныйКлассификатор.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>АдресныйКлассификатор</Name>
			<Comment>Регистр сведений адресный классификатор</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Comment>Наименование</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>52</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сокращение</Name>
					<Comment>Сокращение</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Индекс</Name>
					<Comment>Индекс</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АльтернативныеНазвания</Name>
					<Comment>Альтернативные названия</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТипАдресногоЭлемента</Name>
					<Comment>Тип адресного элемента</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРайонаВКоде</Name>
					<Comment>Код района в коде</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодГородаВКоде</Name>
					<Comment>Код города в коде</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодНаселенногоПунктаВКоде</Name>
					<Comment>Код населенного пункта в коде</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУлицыВКоде</Name>
					<Comment>Код улицы в коде</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Код</Name>
					<Comment>Код</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодРегионаВКоде</Name>
					<Comment>Код региона в коде</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствОбъектов</Name>
			<Comment>В регистре хранятся значения дополнительных свойств объектов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>Значение свойства</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект (справочник или документ) для которого существуют и могут быть назначены дополнительные свойства</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НазначенияСвойствОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Comment>Вид свойства</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РегистрацияЗвонковИКонтактов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>РегистрацияЗвонковИКонтактов</Name>
			<Comment>Регистр служит для хранения истории звонков и контактов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидКонтакта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСобытий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Реклама</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВторичныйКонтакт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредметОбращения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПредметыОбращения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Участник</Name>
					<Comment>Сотрудник, которому предназначено напоминание для зарегистрированного события</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодРегиона</Name>
					<Comment>Код региона</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодГорода</Name>
					<Comment>Код города</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерТелефона</Name>
					<Comment>Номер телефона</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнутреннийНомер</Name>
					<Comment>Внутренний номер</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредставлениеТелефона</Name>
					<Comment>Представление телефона</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидТелефона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСобытие</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлиентСервиса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РабочийЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РабочийЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.РабочийЛистСервиса</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСообщений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидПокупки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидПокупки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеУдалосьСоединить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаДень</Name>
					<Comment>Дата (день)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВремя</Name>
					<Comment>Дата (время)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Comment>Клиент</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>510</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>streceptionURN</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЖурналСостояний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЖурналСостояний</Name>
			<Comment>Журнал состояний заказ-нарядов</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Comment>Состояние объекта</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСостоянийЗаказНарядов</v8:Type>
						<v8:Type>cfg:CatalogRef.СтатусыРабочегоЛиста</v8:Type>
						<v8:Type>cfg:EnumRef.СостояниеЖалобКлиентов</v8:Type>
						<v8:Type>cfg:EnumRef.СостоянияСобытий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор изменения состояния</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Компьютер</Name>
					<Comment>Компьютер</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект состояния</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ОбращениеКлиентаHyundai</v8:Type>
						<v8:Type>cfg:DocumentRef.РабочийЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.РабочийЛистКредитногоОтдела</v8:Type>
						<v8:Type>cfg:DocumentRef.РабочийЛистСервиса</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.РабочийЛистОтделаСтрахования</v8:Type>
						<v8:Type>cfg:DocumentRef.Рассылка</v8:Type>
						<v8:Type>cfg:DocumentRef.КомплектацияАвтомобиля</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыводИзОборотаКодовМаркировки</v8:Type>
						<v8:Type>cfg:DocumentRef.ПовторныйРемонт</v8:Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
						<v8:Type>cfg:DocumentRef.ЖалобаКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ОбновлениеИнформационнойБазы/Ext/ObjectModule.bsl
#Если Клиент Тогда
// Обработка обновления информационной базы при первом запуске и смене релиза.
// Не имеет ни форм ни макетов, вызывается только из сеанса клиента и только программно !
// Вызывается из обработки СтартСистемы при несоответствии версии конфигурации константе.

// Основная точка входа обработки, осуществляющая последовательный вызов
// всех проверок и изменений данных в информационной базе
Процедура ВыполнитьОбновление(ПервыйЗапускВДочернемУзле = Ложь) Экспорт
	// Семенихин 13.04.2020 +++++
	Константы.НомерРелизаКонфигурации.Установить(Метаданные.Версия);
	Сообщить("Обновление информационной базы до релиза <"+Метаданные.Версия+"> завершено !");
	Возврат;
	// Семенихин 13.04.2020 -----	

	// Отключим проверки и сообщения на время обновления
	Если НЕ ЗначениеЗаполнено(глПрава) Тогда // Если еще не инициализированы
		Состояние("Получение прав и настроек текущего пользователя...");
		глПрава = обПолучитьПраваИНастройкиПользователя(ПараметрыСеанса.Пользователь);
	КонецЕсли;
	// Сначала запомним их текущие состояния
	ПВХ = ПланыВидовХарактеристик.ПраваИНастройки;
	ВыводитьСообщенияПроверкиПравДоступа = обПраво(ПВХ.ВыводитьСообщенияПроверкиПравДоступа,глПрава);
	ПроверкаДоступаКСправочникамИДокументам = обПраво(ПВХ.ПроверкаДоступаКСправочникамИДокументам,глПрава);
	ПроверкаЗаполненияСправочниковИДокументов = обПраво(ПВХ.ПроверкаЗаполненияСправочниковИДокументов,глПрава);

	ВыводитьСообщениеОбОшибкахВИнформационноеПоле = обПраво(ПВХ.ВыводитьСообщениеОбОшибкахВИнформационноеПоле,глПрава);
	// Потом отключим
	глПрава.Вставить(ПВХ.ВыводитьСообщенияПроверкиПравДоступа,Ложь);
	глПрава.Вставить(ПВХ.ПроверкаДоступаКСправочникамИДокументам,Ложь);
	глПрава.Вставить(ПВХ.ПроверкаЗаполненияСправочниковИДокументов,Ложь);
	глПрава.Вставить(ПВХ.ВыводитьСообщениеОбОшибкахВИнформационноеПоле,Ложь);
	
	// SUIG+ дополнение - не требуется выполнять заполнение прав и настроек в случае,
	// если это подчиненный узел, в котором отцепили главный узел, затем загрузили конфигурацию
	// главного узла. При появлении нового документа в главном узле это чревато дублированием
	// настроек - одна создасется прямо сейчас, другая - при чтении сообщения от главного
	ЗаполнятьПрава = Ложь;
	ЭтотУзел = ПланыОбмена.УдаленныеПодразделения.ЭтотУзел().Ссылка;
	ЭтотУзелИБ = ЭтотУзел.ИнформационнаяБаза;
	Если НЕ ЭтотУзелИБ.Пустая() Тогда
		РодительЭтотУзелИБ = ЭтотУзелИБ.Родитель; // верный родитель в соотв.со структурой ИБ
		
		ГлавныйУзел = ПланыОбмена.ГлавныйУзел();
		// проверка - если нет узла -> родитель по Структуре ИБ, но подчиненный по узлам, то отцепления не было
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	УдаленныеПодразделения.Ссылка КАК УзелОбмена
		|ИЗ
		|	ПланОбмена.УдаленныеПодразделения КАК УдаленныеПодразделения
		|ГДЕ
		|	УдаленныеПодразделения.Ссылка <> &ЭтотУзел
		|	И УдаленныеПодразделения.Ссылка <> &ГлавныйУзел
		|	И УдаленныеПодразделения.ИнформационнаяБаза = &РодительЭтотУзелИБ ";
		Запрос.УстановитьПараметр("ЭтотУзел",ЭтотУзел);
		Запрос.УстановитьПараметр("ГлавныйУзел",ГлавныйУзел);
		Запрос.УстановитьПараметр("РодительЭтотУзелИБ",РодительЭтотУзелИБ);
		Выборка = Запрос.Выполнить().Выбрать();
		Если НЕ Выборка.Следующий() Тогда
			ЗаполнятьПрава = Истина; 
		КонецЕсли;
	Иначе
		ЗаполнятьПрава = Истина; // не с чем сравнить
	КонецЕсли; 
	
	Если НЕ ЗаполнятьПрава Тогда
		СтрСообщения = "При проверке заполнения прав и настроек обнаружено несоответствие иерархии узлов плана обмена <" + ЭтотУзелИБ.Наименование + ">"
		+ " и <" + РодительЭтотУзелИБ.Наименование + ">. Возможно было произведено ""снятие"" главного узла для текущего узла"
		+ Символы.ПС + " <" + ЭтотУзелИБ.Наименование + ">. В данном случае необходимо установить узел <" + РодительЭтотУзелИБ.Наименование + ">"
		+ " в качестве главного узла"; 
		#Если Клиент Тогда
			ТекДата = Формат(ТекущаяДата(),"ДФ='HH:mm:ss dd.MM'") + " ";
			Сообщить(ТекДата + СтрСообщения,СтатусСообщения.Внимание);
		#КонецЕсли 
		ЗаписьЖурналаРегистрации("Обновление", УровеньЖурналаРегистрации.Предупреждение, , , СтрСообщения);
	КонецЕсли; 
	// SUIG-

	Если НЕ ПервыйЗапускВДочернемУзле И ЗаполнятьПрава Тогда
		// Это все барахло мы все равно сейчас будем получать в сообщении от главного узла
		//так что лучше пропустим эти лишние в данный момент действия
		Объект=ПланыВидовХарактеристик.ПраваИНастройки.СоздатьЭлемент();
		Состояние("Выполняются проверки правил префиксации...");
		Объект.ПроверитьПравилаПрефиксации();
		Состояние("Выполняются проверки правил доступа...");
		Объект.ПроверитьПраваДоступа();
		Состояние("Выполняются проверки правил миграции...");
		Объект.ПроверитьПравилаМиграции();
		глПрава = обПолучитьПраваИНастройкиПользователя(ПараметрыСеанса.Пользователь);
	КонецЕсли;

	//выполним проверку и заполнение предопределенных элементов справочников
	ЗаполнитьПредопределенныеЭлементы();
	Сообщить("--------------------------------------------------------");
	
	//// Подготовка к выводу формы изменений в новом релизе
	ФормаОбновлений = ПолучитьФорму("ФормаОбновлений");
	МакетОбновлений    = ПодготовитьМакетОписаниеОбновлений(ФормаОбновлений);
	ДокументОбновлений = ФормаОбновлений.ЭлементыФормы.ДокументОписаниеОбновлений;
	ДокументОбновлений.Очистить();
	ФормаОбновлений.НеПоказыватьИзмененияПриОткрытии = Истина;
	
	//НомерРелизаКонфигурации = Лев(Константы.НомерРелизаКонфигурации.Получить(),7);
    НомерРелизаКонфигурации = Лев(Константы.НомерРелизаКонфигурации.Получить(),10);
	
	// Case по вариантам обновления
	Если ПустаяСтрока(НомерРелизаКонфигурации) Тогда
		// Начальное заполнение базы
		Сообщить("Производится начальное заполнение информационной базы...");
		Сообщить("--------------------------------------------------------");
		
		// Вывод строк описания при первом старте
		ДокументОбновлений.Вывести(МакетОбновлений.ПолучитьОбласть("ШапкаЗаполнениеПустойИБ"));
		ДокументОбновлений.НачатьГруппуСтрок("Заполнение пустой ИБ");
		ДокументОбновлений.Вывести(МакетОбновлений.ПолучитьОбласть("ЗаполнениеПустойИБ"));
		ДокументОбновлений.ЗакончитьГруппуСтрок();
		
		Константы.ИнтервалПроверкиНапоминаний.Установить(5);
		Сообщить("Константа ""Интервал проверки напоминаний"" установлена в 5 минут");
		
		// Заполним порядок распределения статей доходов и расходов
		// Если регистр уже содержит записи, то очистим
		ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПорядокЗакрытияБалансовыхСтатей.Статья.Ссылка
		|ИЗ
		|	РегистрСведений.ПорядокЗакрытияБалансовыхСтатей КАК ПорядокЗакрытияБалансовыхСтатей";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			// Удаляем все движения
			НаборЗаписей = РегистрыСведений.ПорядокЗакрытияБалансовыхСтатей.СоздатьНаборЗаписей();
			НаборЗаписей.Записать(Истина);
		КонецЕсли;
		
		// Заполнение регистра
		РегистрыСведений.ПорядокЗакрытияБалансовыхСтатей.ЗаполнитьПредопределенныеЭлементы();
		Сообщить("Заполнен регистр порядок распределения статей доходов и расходов");
	Иначе // Никаких общих сообщений не выводим
	КонецЕсли; 
	
	// Обновление информационной базы до релиза 5.0.02.01
	Если НомерРелизаКонфигурации < "5.0.02.01" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.0.02.01");
		Попытка		ОбновитьДо_5_0_02_01();
		Исключение	Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
		// Необходимо заменить первый параметр хххххх на номер релиза,
		// для которого выводится описание изменений из шаблона
		//ВывестиОписаниеИзменений("500201", ДокументОбновлений, МакетОбновлений);
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.0.03.01" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.0.03.01");
		Попытка
			ОбновитьДо_5_0_03_01();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
		// Необходимо заменить первый параметр хххххх на номер релиза,
		// для которого выводится описание изменений из шаблона
		//ВывестиОписаниеИзменений("500301", ДокументОбновлений, МакетОбновлений);
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.0.05.02" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.0.05.02");
		Попытка
			ОбновитьДо_5_0_05_02();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
		// Необходимо заменить первый параметр хххххх на номер релиза,
		// для которого выводится описание изменений из шаблона
		//ВывестиОписаниеИзменений("500502", ДокументОбновлений, МакетОбновлений);
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.0.05.07" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.0.05.07");
		Попытка
			ОбновитьДо_5_0_05_07();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
		// Необходимо заменить первый параметр хххххх на номер релиза,
		// для которого выводится описание изменений из шаблона
		//ВывестиОписаниеИзменений("500507", ДокументОбновлений, МакетОбновлений);
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.0.05.08" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.0.05.08");
		Попытка
			ОбновитьДо_5_0_05_08();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
		// Необходимо заменить первый параметр хххххх на номер релиза,
		// для которого выводится описание изменений из шаблона
		//ВывестиОписаниеИзменений("500508", ДокументОбновлений, МакетОбновлений);
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.0.05.09" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.0.05.09");
		Попытка
			ОбновитьДо_5_0_05_09();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
		// Необходимо заменить первый параметр хххххх на номер релиза,
		// для которого выводится описание изменений из шаблона
		//ВывестиОписаниеИзменений("500509", ДокументОбновлений, МакетОбновлений);
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.0.06.01" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.0.06.01");
		Попытка
			ОбновитьДо_5_0_06_01();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
		// Необходимо заменить первый параметр хххххх на номер релиза,
		// для которого выводится описание изменений из шаблона
		//ВывестиОписаниеИзменений("500601", ДокументОбновлений, МакетОбновлений);
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.0.07.01" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.0.07.01");
		Попытка
			ОбновитьДо_5_0_07_01();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
		// Необходимо заменить первый параметр хххххх на номер релиза,
		// для которого выводится описание изменений из шаблона
		//ВывестиОписаниеИзменений("500701", ДокументОбновлений, МакетОбновлений);
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.0.07.02" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.0.07.02");
		Попытка
			ОбновитьДо_5_0_07_02();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
		// Необходимо заменить первый параметр хххххх на номер релиза,
		// для которого выводится описание изменений из шаблона
		//ВывестиОписаниеИзменений("500701", ДокументОбновлений, МакетОбновлений);
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.0.07.03" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.0.07.03");
		Попытка
			ОбновитьДо_5_0_07_03();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
		// Необходимо заменить первый параметр хххххх на номер релиза,
		// для которого выводится описание изменений из шаблона
		//ВывестиОписаниеИзменений("500701", ДокументОбновлений, МакетОбновлений);
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.0.08.04" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.0.08.04");
		Попытка
			ОбновитьДо_5_0_08_04();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
		// Необходимо заменить первый параметр хххххх на номер релиза,
		// для которого выводится описание изменений из шаблона
		//ВывестиОписаниеИзменений("500701", ДокументОбновлений, МакетОбновлений);
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.0.10.02" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.0.10.02");
		Попытка
			ОбновитьДо_5_0_10_02();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
		// Необходимо заменить первый параметр хххххх на номер релиза,
		// для которого выводится описание изменений из шаблона
		//ВывестиОписаниеИзменений("500701", ДокументОбновлений, МакетОбновлений);
	КонецЕсли;

	
	// Восстановим исходное состояние проверок и сообщений
	глПрава.Вставить(ПВХ.ВыводитьСообщенияПроверкиПравДоступа,ВыводитьСообщенияПроверкиПравДоступа);
	глПрава.Вставить(ПВХ.ПроверкаДоступаКСправочникамИДокументам,ПроверкаДоступаКСправочникамИДокументам);
	глПрава.Вставить(ПВХ.ПроверкаЗаполненияСправочниковИДокументов,ПроверкаЗаполненияСправочниковИДокументов);
	глПрава.Вставить(ПВХ.ВыводитьСообщениеОбОшибкахВИнформационноеПоле,ВыводитьСообщениеОбОшибкахВИнформационноеПоле);
	
	// Обновление выполнено успешно
	Константы.НомерРелизаКонфигурации.Установить(Метаданные.Версия);
	Сообщить("Обновление информационной базы до релиза <"+Метаданные.Версия+"> завершено !");
	
	//Выведем Форму со списком обновлений в релизе
	#Если Клиент Тогда
	Если ДокументОбновлений.ВысотаТаблицы > 0 Тогда
		ФормаОбновлений.Открыть();
	КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

// Функция получает макет описания обновлений и заполняет его параметры расшифровок.
//
// Параметры:
//  ФормаОписаниеОбновлений - форма обработки "ОписаниеОбновлений", 
//                            назначается владельцем открываемых из нее форм.
//
// Возвращаемое значение:
//  ТабличныйДокумент - макет "ОписаниеОбновлений" с заполненными параметрами расшифровок.
//
Функция ПодготовитьМакетОписаниеОбновлений(ФормаОписаниеОбновлений) Экспорт

	МакетОписаниеОбновлений = ПолучитьМакет("МакетОбновлений");
	Параметры               = МакетОписаниеОбновлений.Параметры;

	// Заполнение параметров расшифровок макета описания обновлений,

	Параметры.ФормаПодбораВалют            = Справочники.Валюты.ПолучитьФорму("ФормаПодбораИзКлассификатора");
	Параметры.ФормаСпискаВалют             = Справочники.Валюты.ПолучитьФормуСписка();
	Параметры.ФормаЗагрузкиКурсов          = Обработки.КурсыВалютРБК.ПолучитьФорму();
	Параметры.ФормаПодбораЕдиниц           = Справочники.КлассификаторЕдиницИзмерения.ПолучитьФорму("ФормаПодбораИзКлассификатора");
	Параметры.ФормаСпискаЕдиниц            = Справочники.КлассификаторЕдиницИзмерения.ПолучитьФормуСписка();
	
	Параметры.ФормаСпискаКонтрагентов      = Справочники.Контрагенты.ПолучитьФормуСписка();
	Параметры.ФормаСпискаСотрудников       = Справочники.Сотрудники.ПолучитьФормуСписка();
	Параметры.ФормаСпискаНоменклатуры      = Справочники.Номенклатура.ПолучитьФормуСписка();
	Параметры.ФормаСпискаТиповНоменклатуры = Справочники.ТипыНоменклатуры.ПолучитьФормуСписка();
	Параметры.ФормаСпискаСклады			   = Справочники.СкладыКомпании.ПолучитьФормуСписка();
	Параметры.ФормаСпискаТиповЦен          = Справочники.ТипыЦен.ПолучитьФормуСписка();
	Параметры.ФормаНовойОрганизации 	   = Справочники.Организации.ОсновнаяОрганизация.ПолучитьФорму();
	Параметры.ФормаСпискаОрганизаций       = Справочники.Организации.ПолучитьФормуСписка();
	Параметры.ФормаСпискаПодразделений     = Справочники.ПодразделенияКомпании.ПолучитьФормуСписка();

	Параметры.ФормаКонстант                = Константы.ПолучитьФорму();
	Параметры.ФормаСпискаПользователей     = Справочники.Пользователи.ПолучитьФормуСписка();
	Параметры.ФормаПользователя            = ПараметрыСеанса.Пользователь;
	Параметры.ФормаПравИНастроек	       = "ФормаПравИНастроек";
	
	Параметры.ФормаАдресногоКлассификатора = РегистрыСведений.АдресныйКлассификатор.ПолучитьФормуСписка();
	Параметры.ФормаСтанцииМетро			   = Справочники.СтанцииМетро.ПолучитьФормуСписка();
	Параметры.ФормаРайонов				   = Справочники.Районы.ПолучитьФормуСписка();

	Возврат МакетОписаниеОбновлений;

КонецФункции // ПодготовитьМакетОписаниеОбновлений()

// Заполнение предопределенных элементов справочников, ПВХ и т.п.
// Предназначена для установки незаполненных реквизитов предопределенных элементов
// Выполняется при любом обновлении конфигурации и вызывает приватные процедуры
// заполнения каждого справочника (ПВХ), где это поддерживается, через его макет.
// Процедура универсальна для нескольких типовых решений и обрабатывает каждый
// конкретный объект через Попытку/Исключение (некоторых может не быть в конфигурации)
Процедура ЗаполнитьПредопределенныеЭлементы() Экспорт
	
	//Подготовим список объектов, подлежащих первоначальному заполнению
	//Порядок следования объектов заполнения от подчиненных
	СписокЗначенийЗаполнения=Новый СписокЗначений;
	//Классификаторы и свойства
	СписокЗначенийЗаполнения.Добавить(ПланыВидовХарактеристик.НазначенияСвойствОбъектов,Метаданные.ПланыВидовХарактеристик.НазначенияСвойствОбъектов.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.Валюты,Метаданные.Справочники.Валюты.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.Должности,Метаданные.Справочники.Должности.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.КлассификаторЕдиницИзмерения,Метаданные.Справочники.КлассификаторЕдиницИзмерения.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.СтатьиДДС,Метаданные.Справочники.СтатьиДДС.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.СтатьиДоходовИРасходов,Метаданные.Справочники.СтатьиДоходовИРасходов.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.СтавкиНДС,Метаданные.Справочники.СтавкиНДС.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.ТипыОплат,Метаданные.Справочники.ТипыОплат.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.ТипыНоменклатуры,Метаданные.Справочники.ТипыНоменклатуры.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.ТипыЦен,Метаданные.Справочники.ТипыЦен.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(ПланыВидовХарактеристик.ТипыСделок,Метаданные.ПланыВидовХарактеристик.ТипыСделок.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(ПланыВидовХарактеристик.ТипыПартий,Метаданные.ПланыВидовХарактеристик.ТипыПартий.Представление(),Ложь);
	//Контактная информация
	СписокЗначенийЗаполнения.Добавить(Справочники.ВидыКонтактнойИнформации,Метаданные.Справочники.ВидыКонтактнойИнформации.Представление(),Ложь);
	//Графики и смены
	СписокЗначенийЗаполнения.Добавить(Справочники.ВидыИнтервалов,Метаданные.Справочники.ВидыИнтервалов.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.Смены,Метаданные.Справочники.Смены.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.ГрафикиРаботы,Метаданные.Справочники.ГрафикиРаботы.Представление(),Ложь);
	//Организационная структура компании
	СписокЗначенийЗаполнения.Добавить(Справочники.Организации,Метаданные.Справочники.Организации.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.ПодразделенияКомпании,Метаданные.Справочники.ПодразделенияКомпании.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.Пользователи,Метаданные.Справочники.Пользователи.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.КассыКомпании,Метаданные.Справочники.КассыКомпании.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.СкладыКомпании,Метаданные.Справочники.СкладыКомпании.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.Цеха,Метаданные.Справочники.Цеха.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(ПланыВидовРасчета.НачисленияИУдержания,Метаданные.ПланыВидовРасчета.НачисленияИУдержания.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.УчетныеЗаписиЭлектроннойПочты,Метаданные.Справочники.УчетныеЗаписиЭлектроннойПочты.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(ПланыВидовХарактеристик.АналитическиеРазрезыПланирования,Метаданные.ПланыВидовХарактеристик.АналитическиеРазрезыПланирования.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(ПланыВидовХарактеристик.ПараметрыПланирования,Метаданные.ПланыВидовХарактеристик.ПараметрыПланирования.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.ВидыПлановКомпании,Метаданные.Справочники.ВидыПлановКомпании.Представление(),Ложь);
	//Номенклатура
	СписокЗначенийЗаполнения.Добавить(Справочники.Номенклатура,Метаданные.Справочники.Номенклатура.Представление(),Ложь);
	//Внешние печатные формы
	СписокЗначенийЗаполнения.Добавить(Справочники.ВнешниеПечатныеФормы,Метаданные.Справочники.ВнешниеПечатныеФормы.Представление(),Ложь);
	//Распределенная структура информационной базы
	СписокЗначенийЗаполнения.Добавить(Справочники.НастройкиДоставкиСообщений,Метаданные.Справочники.НастройкиДоставкиСообщений.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.ПравилаМиграцииИДоступа,Метаданные.Справочники.ПравилаМиграцииИДоступа.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(ПланыОбмена.УдаленныеПодразделения,Метаданные.ПланыОбмена.УдаленныеПодразделения.Представление(),Ложь);
	//Идентификация
	СписокЗначенийЗаполнения.Добавить(Справочники.Контрагенты,Метаданные.Справочники.Контрагенты.Представление(),Ложь);
	//Прочее
	СписокЗначенийЗаполнения.Добавить(Справочники.Карточки,Метаданные.Справочники.Карточки.Представление(),Ложь);
	//Автосервис
	СписокЗначенийЗаполнения.Добавить(Справочники.Автоработы,Метаданные.Справочники.Автоработы.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.Нормочасы,Метаданные.Справочники.Нормочасы.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.ВариантыКомплектации,Метаданные.Справочники.ВариантыКомплектации.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.ВидыОтметокВремени,Метаданные.Справочники.ВидыОтметокВремени.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.ВидыСостоянийЗаказНарядов,Метаданные.Справочники.ВидыСостоянийЗаказНарядов.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.ВидыРемонта,Метаданные.Справочники.ВидыРемонта.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.КатегорииТранспортныхСредств,Метаданные.Справочники.КатегорииТранспортныхСредств.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.Дефекты,Метаданные.Справочники.Дефекты.Представление(),Ложь);
	// Взаимоотношения с клиентами
	СписокЗначенийЗаполнения.Добавить(Справочники.СтатусыРабочегоЛиста,Метаданные.Справочники.СтатусыРабочегоЛиста.Представление(),Ложь);
	// // Заполняем ПВХ ВопросыДляАнкетирования, а именно предопределенные вопросы.
	СписокЗначенийЗаполнения.Добавить(ПланыВидовХарактеристик.ВопросыДляАнкетирования,Метаданные.ПланыВидовХарактеристик.ВопросыДляАнкетирования.Представление(),Ложь);
		
	//Заполним предопределенные элементы объектов
	Для каждого ЭлементЗаполнения Из СписокЗначенийЗаполнения Цикл
		Попытка
			Состояние("Проверка заполнения <"+ЭлементЗаполнения.Представление+">");
			ЭлементЗаполнения.Значение.ЗаполнитьПредопределенныеЭлементы(ЭлементЗаполнения.Пометка);
		Исключение
			Сообщить("Ошибка при заполнении объектов <"+ЭлементЗаполнения.Представление+">: "+ОписаниеОшибки());
		КонецПопытки; 
	КонецЦикла; 
	
КонецПроцедуры

// Обновление до х.х.хх.хх
//
Процедура ОбновитьДо_5_0_01_01()
	//Шаблон процедуры обновления	
КонецПроцедуры

// Обновление до 5.0.02.01
//
Процедура ОбновитьДо_5_0_02_01()
	//Обновление флага выработки сотрудников по заказ-нарядам
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ЗаказНаряд.Ссылка КАК ЗаказНаряд,
	             |	ЗаказНаряд.Представление КАК Представление,
	             |	ЗаказНаряд.ВидРемонта КАК ВидРемонта,
	             |	ЗаказНаряд.ВидРемонта.ВыработкаСотрудниковПоВыполнениюЗаказНаряда КАК ВидРемонтаВыработкаСотрудниковПоВыполнениюЗаказНаряда,
				 |	ЗаказНаряд.Состояние КАК Состояние,
				 |	ЗаказНаряд.ДатаОкончания КАК ДатаОкончания,
				 |	ЗаказНаряд.ДатаЗакрытия КАК ДатаЗакрытия
				 |ИЗ
	             |	Документ.ЗаказНаряд КАК ЗаказНаряд
	             |ГДЕ
	             |	ЗаказНаряд.ВыработкаСотрудниковПоВыполнениюЗаказНаряда <> ЗаказНаряд.ВидРемонта.ВыработкаСотрудниковПоВыполнениюЗаказНаряда
	             |	ИЛИ
				 |	(ЗаказНаряд.Состояние=ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт) И ЗаказНаряд.ДатаЗакрытия = &ДатаПустая)
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	ЗаказНаряд.Дата";
	Запрос.УстановитьПараметр("ДатаПустая",Дата('00010101'));
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Количество()>0 Тогда
		Сообщить("Обновление флага начисления выработки сотрудников по заказ-нарядам ...");
		Пока Выборка.Следующий() Цикл
			ЗаказНарядОбъект=Выборка.ЗаказНаряд.ПолучитьОбъект();
			ЗаказНарядОбъект.ВыработкаСотрудниковПоВыполнениюЗаказНаряда=Выборка.ВидРемонтаВыработкаСотрудниковПоВыполнениюЗаказНаряда;
			Если Выборка.Состояние=Справочники.ВидыСостоянийЗаказНарядов.Закрыт И обЗначениеНеЗаполнено(Выборка.ДатаЗакрытия) Тогда
				ЗаказНарядОбъект.ДатаЗакрытия=Выборка.ДатаОкончания;
			КонецЕсли; 
			ЗаказНарядОбъект.ОбменДанными.Загрузка=Истина;
			Попытка
				ЗаказНарядОбъект.Записать();
				Сообщить("Обновлен заказ-наряд <"+Выборка.Представление+">.");
			Исключение
				Сообщить("Ошибка обновления заказ-наряда <"+Выборка.Представление+">: "+ОписаниеОшибки());
			КонецПопытки; 
		КонецЦикла;
		Сообщить("Обновление флага начисления выработки сотрудников по заказ-нарядам завершено.");
	КонецЕсли; 
КонецПроцедуры

// Обновление до 5.0.03.01
//
Процедура ОбновитьДо_5_0_03_01()
	
	//Обновление уведомления о резервировании заказов покупателей
	НаборЗаписей = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Свойство.Использование = Истина;
	НаборЗаписей.Отбор.Свойство.ВидСравнения  = ВидСравнения.Равно;
	НаборЗаписей.Отбор.Свойство.Значение      = ПланыВидовХарактеристик.СвойстваОбъектов.УведомлениеОРезервировании;
	НаборЗаписей.Прочитать();
	
	Счетчик = 0;
	Для Каждого ТекЗапись Из НаборЗаписей Цикл
		Если ТипЗнч(ТекЗапись.Значение) = Тип("Булево") Тогда
			Если ТекЗапись.Значение = Истина Тогда
				ТекЗапись.Значение = 1;
			Иначе
				ТекЗапись.Значение = 0;
			КонецЕсли;
			Счетчик = Счетчик + 1;
		КонецЕсли;
	КонецЦикла;
	Если Счетчик > 0 Тогда
		НаборЗаписей.Записать(Истина);
		Сообщить("Обновлены уведомления о резервировании заказов покупателей.");
	КонецЕсли;
	
	// Обновление наименования клиента в рабочих листах
	ЗапросРабочихЛистов			= Новый Запрос();
	ЗапросРабочихЛистов.Текст	= "ВЫБРАТЬ
	                         	  |	РабочийЛист.Ссылка КАК Ссылка
	                         	  |ИЗ
	                         	  |	Документ.РабочийЛист КАК РабочийЛист";
	ВыборкаРабочихЛистов	= ЗапросРабочихЛистов.Выполнить().Выбрать();
	Пока ВыборкаРабочихЛистов.Следующий() Цикл
		СсылкаНаДокумент	= ВыборкаРабочихЛистов.Ссылка;
		// Чтобы не потерять наименование клиента, когда не заполнен контрагент, его
		// необходимо перенести
		Если обЗначениеНеЗаполнено(СсылкаНаДокумент.Контрагент) Тогда
			ТекОбъект	= ВыборкаРабочихЛистов.Ссылка.ПолучитьОбъект();
			Если ТекОбъект<>Неопределено Тогда
				ТекОбъект.Контрагент	= СсылкаНаДокумент.УдалитьНаименованиеКлиента;
				Попытка
					ТекОбъект.Записать();
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// Обновление наименования клиента в рабочих листах кредитного отдела
	ЗапросРабочихЛистовКО	= Новый Запрос();
	ЗапросРабочихЛистовКО.Текст	= "ВЫБРАТЬ
	                         	  |	РабочийЛистКредитногоОтдела.Ссылка КАК Ссылка
	                         	  |ИЗ
	                         	  |	Документ.РабочийЛистКредитногоОтдела КАК РабочийЛистКредитногоОтдела";
	ВыборкаРабочихЛистовКО	= ЗапросРабочихЛистовКО.Выполнить().Выбрать();
	Пока ВыборкаРабочихЛистовКО.Следующий() Цикл
		СсылкаНаДокумент	= ВыборкаРабочихЛистовКО.Ссылка;
		// Чтобы не потерять наименование клиента, когда не заполнен контрагент, его
		// необходимо перенести
		Если обЗначениеНеЗаполнено(СсылкаНаДокумент.Клиент) Тогда
			ТекОбъект	= ВыборкаРабочихЛистовКО.Ссылка.ПолучитьОбъект();
			Если ТекОбъект<>Неопределено Тогда
				ТекОбъект.Клиент	= СсылкаНаДокумент.УдалитьНаименованиеКлиента;
				Попытка
					ТекОбъект.Записать();
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// Обновление наименования клиента в рабочих листах отдела страхования
	ЗапросРабочихЛистовОС	= Новый Запрос();
	ЗапросРабочихЛистовОС.Текст	= "ВЫБРАТЬ
	                         	  |	РабочийЛистОтделаСтрахования.Ссылка
	                         	  |ИЗ
	                         	  |	Документ.РабочийЛистОтделаСтрахования КАК РабочийЛистОтделаСтрахования";
	ВыборкаРабочихЛистовОС	= ЗапросРабочихЛистовОС.Выполнить().Выбрать();
	Пока ВыборкаРабочихЛистовОС.Следующий() Цикл
		СсылкаНаДокумент	= ВыборкаРабочихЛистовОС.Ссылка;
		// Чтобы не потерять наименование клиента, когда не заполнен контрагент, его
		// необходимо перенести
		Если обЗначениеНеЗаполнено(СсылкаНаДокумент.Страхователь) Тогда
			ТекОбъект	= ВыборкаРабочихЛистовОС.Ссылка.ПолучитьОбъект();
			Если ТекОбъект<>Неопределено Тогда
				ТекОбъект.Страхователь	= СсылкаНаДокумент.УдалитьНаименованиеКлиента;
				Попытка
					ТекОбъект.Записать();
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// В регистр сведений добавлено измерение Автор, которое необходимо заполнить
	ЗапросКонтактов			= Новый Запрос();
	ЗапросКонтактов.Текст	= "ВЫБРАТЬ
	                     	  |	РегистрацияЗвонковИКонтактов.Автор,
	                     	  |	РегистрацияЗвонковИКонтактов.ДатаДень,
	                     	  |	РегистрацияЗвонковИКонтактов.ДатаВремя,
	                     	  |	РегистрацияЗвонковИКонтактов.Сотрудник,
	                     	  |	РегистрацияЗвонковИКонтактов.Клиент,
	                     	  |	РегистрацияЗвонковИКонтактов.Организация,
	                     	  |	РегистрацияЗвонковИКонтактов.Подразделение,
	                     	  |	РегистрацияЗвонковИКонтактов.Модель,
	                     	  |	РегистрацияЗвонковИКонтактов.ВидКонтакта,
	                     	  |	РегистрацияЗвонковИКонтактов.Реклама,
	                     	  |	РегистрацияЗвонковИКонтактов.ВторичныйКонтакт,
	                     	  |	РегистрацияЗвонковИКонтактов.ЮридическоеЛицо,
	                     	  |	РегистрацияЗвонковИКонтактов.Примечание
	                     	  |ИЗ
	                     	  |	РегистрСведений.РегистрацияЗвонковИКонтактов КАК РегистрацияЗвонковИКонтактов";
	ВыборкаКонтактов		= ЗапросКонтактов.Выполнить().Выбрать();
	ТаблицаЗвонковВстреч	= РегистрыСведений.РегистрацияЗвонковИКонтактов.СоздатьНаборЗаписей();
	Пока ВыборкаКонтактов.Следующий() Цикл		
		Если НЕ обЗначениеНеЗаполнено(ВыборкаКонтактов.Автор) Тогда Продолжить; КонецЕсли;
		
		ТаблицаЗвонковВстреч.Отбор.Автор.Установить(Справочники.Пользователи.ПустаяСсылка());
		ТаблицаЗвонковВстреч.Отбор.ДатаДень.Установить(ВыборкаКонтактов.ДатаДень);
		ТаблицаЗвонковВстреч.Отбор.ДатаВремя.Установить(ВыборкаКонтактов.ДатаВремя);
		ТаблицаЗвонковВстреч.Отбор.Сотрудник.Установить(ВыборкаКонтактов.Сотрудник);
		ТаблицаЗвонковВстреч.Отбор.Клиент.Установить(ВыборкаКонтактов.Клиент);
		ТаблицаЗвонковВстреч.Прочитать();
		ТаблицаЗвонковВстреч.Очистить();
		Попытка
			ТаблицаЗвонковВстреч.Записать();
		Исключение КонецПопытки;
		
		ТаблицаЗвонковВстреч.Отбор.Автор.Установить(ПараметрыСеанса.Пользователь);
		ТаблицаЗвонковВстреч.Прочитать();
		
		НоваяСтрока						= ТаблицаЗвонковВстреч.Добавить();
		НоваяСтрока.Автор				= ПараметрыСеанса.Пользователь;
		НоваяСтрока.ДатаДень			= ВыборкаКонтактов.ДатаДень;
		НоваяСтрока.ДатаВремя			= ВыборкаКонтактов.ДатаВремя;
		НоваяСтрока.Сотрудник			= ВыборкаКонтактов.Сотрудник;
		НоваяСтрока.Клиент				= ВыборкаКонтактов.Клиент;
		НоваяСтрока.ВидКонтакта			= ВыборкаКонтактов.ВидКонтакта;
		НоваяСтрока.Реклама				= ВыборкаКонтактов.Реклама;
		НоваяСтрока.Модель				= ВыборкаКонтактов.Модель;
		НоваяСтрока.ВторичныйКонтакт	= ВыборкаКонтактов.ВторичныйКонтакт;
		НоваяСтрока.ЮридическоеЛицо		= ВыборкаКонтактов.ЮридическоеЛицо;
		НоваяСтрока.Организация			= ВыборкаКонтактов.Организация;
		НоваяСтрока.Подразделение		= ВыборкаКонтактов.Подразделение;
		НоваяСтрока.Примечание			= ВыборкаКонтактов.Примечание;
		
		Попытка
			ТаблицаЗвонковВстреч.Записать();
		Исключение КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

// Обновление до 5.0.05.02
//
Процедура ОбновитьДо_5_0_05_02()
	// Обновление работ по видам ремонта
	Запрос=Новый Запрос();
	Запрос.Текст	= "ВЫБРАТЬ РАЗЛИЧНЫЕ
	            	  |	ВидыРемонтаРаботы.Ссылка КАК ВидРемонта
	            	  |ИЗ
	            	  |	Справочник.ВидыРемонта.Работы КАК ВидыРемонтаРаботы
	            	  |ГДЕ
	            	  |	ВидыРемонтаРаботы.Количество = 0";
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Количество()>0 Тогда
		Сообщить("Обновление работ по видам ремонта ...");
		Пока Выборка.Следующий() Цикл
			ВидРемонтаСсылка=Выборка.ВидРемонта;
			ВидРемонтаОбъект=ВидРемонтаСсылка.ПолучитьОбъект();
			Для каждого СтрокаРабот Из ВидРемонтаОбъект.Работы Цикл
				Если СтрокаРабот.Количество=0 Тогда
					СтрокаРабот.Количество=1;
				КонецЕсли; 
			КонецЦикла; 
			ВидРемонтаОбъект.ОбменДанными.Загрузка=Истина;
			Попытка
				ВидРемонтаОбъект.Записать();
				Сообщить("Обновлен вид ремонта <"+ВидРемонтаСсылка+">.");
			Исключение
				Сообщить("Ошибка обновления вида ремонта <"+ВидРемонтаСсылка+">: "+ОписаниеОшибки());
			КонецПопытки; 
		КонецЦикла;
		Сообщить("Обновление работ по видам ремонта завершено.");
	КонецЕсли; 
КонецПроцедуры

// Обновление до 5.0.05.07
//
Процедура ОбновитьДо_5_0_05_07()
	// Обновление переразмещений товаров
	Запрос=Новый Запрос();
	Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ПереразмещениеТоваров.Ссылка КАК Ссылка
	             |ИЗ
	             |	Документ.ПереразмещениеТоваров КАК ПереразмещениеТоваров
	             |ГДЕ
	             |	ПереразмещениеТоваров.СкладПолучатель = &СкладПустой
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Ссылка";
	Запрос.УстановитьПараметр("СкладПустой",Справочники.СкладыКомпании.ПустаяСсылка());
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Количество()>0 Тогда
		Сообщить("Обновление документов ""Переразмещение товаров"" ...");
		Пока Выборка.Следующий() Цикл
			ПереразмещениеТоваровСсылка=Выборка.Ссылка;
			ПереразмещениеТоваровОбъект=ПереразмещениеТоваровСсылка.ПолучитьОбъект();
			ПереразмещениеТоваровОбъект.СкладПолучатель=ПереразмещениеТоваровОбъект.СкладКомпании;
			ПереразмещениеТоваровОбъект.ОбменДанными.Загрузка=Истина;
			Попытка
				ПереразмещениеТоваровОбъект.Записать();
				Сообщить("Обновлен документ <"+ПереразмещениеТоваровСсылка+">.");
			Исключение
				Сообщить("Ошибка обновления документа <"+ПереразмещениеТоваровСсылка+">: "+ОписаниеОшибки());
			КонецПопытки; 
		КонецЦикла;
		Сообщить("Обновление документов ""Переразмещение товаров"" завершено.");
	КонецЕсли; 
КонецПроцедуры

// Обновление до 5.0.05.08
//
Процедура ОбновитьДо_5_0_05_08()
	// Обновление состояний заказ-нарядов
	Сообщить("Обновление справочника ""Состояния заказ-нарядов"" ...");
	
	СостояниеОбъект=Справочники.ВидыСостоянийЗаказНарядов.НачатьРаботу.ПолучитьОбъект();
	СостояниеОбъект.Цвет=Новый ХранилищеЗначения(WebЦвета.Древесный);
	СостояниеОбъект.ОбменДанными.Загрузка=Истина;
	Попытка
		СостояниеОбъект.Записать();
		Сообщить("Обновлен элемент <"+СостояниеОбъект+">.");
	Исключение
		Сообщить("Ошибка обновления элемента <"+СостояниеОбъект+">: "+ОписаниеОшибки());
	КонецПопытки; 
	
	СостояниеОбъект=Справочники.ВидыСостоянийЗаказНарядов.ВРаботе.ПолучитьОбъект();
	СостояниеОбъект.Цвет=Новый ХранилищеЗначения(WebЦвета.БледноМиндальный);
	СостояниеОбъект.ОбменДанными.Загрузка=Истина;
	Попытка
		СостояниеОбъект.Записать();
		Сообщить("Обновлен элемент <"+СостояниеОбъект+">.");
	Исключение
		Сообщить("Ошибка обновления элемента <"+СостояниеОбъект+">: "+ОписаниеОшибки());
	КонецПопытки; 
	
	СостояниеОбъект=Справочники.ВидыСостоянийЗаказНарядов.Выполнен.ПолучитьОбъект();
	СостояниеОбъект.Цвет=Новый ХранилищеЗначения(WebЦвета.ГолубойСоСтальнымОттенком);
	СостояниеОбъект.ОбменДанными.Загрузка=Истина;
	Попытка
		СостояниеОбъект.Записать();
		Сообщить("Обновлен элемент <"+СостояниеОбъект+">.");
	Исключение
		Сообщить("Ошибка обновления элемента <"+СостояниеОбъект+">: "+ОписаниеОшибки());
	КонецПопытки; 
	
	СостояниеОбъект=Справочники.ВидыСостоянийЗаказНарядов.Закрыт.ПолучитьОбъект();
	СостояниеОбъект.Цвет=Новый ХранилищеЗначения(WebЦвета.Розовый);
	СостояниеОбъект.ОбменДанными.Загрузка=Истина;
	Попытка
		СостояниеОбъект.Записать();
		Сообщить("Обновлен элемент <"+СостояниеОбъект+">.");
	Исключение
		Сообщить("Ошибка обновления элемента <"+СостояниеОбъект+">: "+ОписаниеОшибки());
	КонецПопытки; 
	
	Сообщить("Обновление справочника ""Состояния заказ-нарядов"" завершено.");
КонецПроцедуры

// Обновление до 5.0.05.09
//
Процедура ОбновитьДо_5_0_05_09()
	Сообщить("Обновление регистра сведений ""Журнал состояний"" ...");
	// перезапись автора из регистра ЖурналСостояний из типа строка в тип пользователи
	НаборЗаписейЖурналСостояний = РегистрыСведений.ЖурналСостояний.СоздатьНаборЗаписей();
	НаборЗаписейЖурналСостояний.Прочитать();
	
	Для Каждого ЗаписьРегистра Из НаборЗаписейЖурналСостояний Цикл
		Если ТипЗнч(ЗаписьРегистра.Автор) = Тип("Строка") Тогда
			// так как длинна наименования в справочнике 100, а в регистре 50 то поиск по не полному соответствию
			СсылкаНаПользователя = Справочники.Пользователи.НайтиПоНаименованию(ЗаписьРегистра.Автор,Ложь,,);
			Если НЕ обЗначениеНеЗаполнено(СсылкаНаПользователя) Тогда
				ЗаписьРегистра.Автор =СсылкаНаПользователя;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Попытка
		НаборЗаписейЖурналСостояний.Записать();
	Исключение
		Сообщить("Ошибка обновления регистра сведений ""Журнал состояний"": "+ОписаниеОшибки());
	КонецПопытки;
	
	Сообщить("Обновление регистра сведений ""Журнал состояний"" завершено.");
КонецПроцедуры

// Обновление до 5.0.06.01
//
Процедура ОбновитьДо_5_0_06_01()
	
	РегламентноеЗадание = РегламентныеЗадания.НайтиПредопределенное("ПроверкаСМС");
	Если РегламентноеЗадание.Параметры.Количество() = 0 Тогда
		СтруктураПараметров = Новый Структура;
		Параметры = Новый Массив;
		Параметры.Добавить(СтруктураПараметров);
		РегламентноеЗадание.Параметры = Параметры;
		РегламентноеЗадание.Записать();
	КонецЕсли;
	
КонецПроцедуры

// Обновление до 5.0.07.01
//
Процедура ОбновитьДо_5_0_07_01()
	// Обновление переразмещений товаров
	Запрос=Новый Запрос();
	Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	Автомобили.Ссылка КАК Ссылка
	             |ИЗ
	             |	Справочник.Автомобили КАК Автомобили
	             |ГДЕ
	             |	Автомобили.ЭтоГруппа = ЛОЖЬ
	             |	И (ВЫРАЗИТЬ(Автомобили.НаименованиеПолное КАК СТРОКА(10))) = """"
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Ссылка";
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Количество()>0 Тогда
		Сообщить("Обновление справочника ""Автомобили"" ...");
		Пока Выборка.Следующий() Цикл
			АвтомобильСсылка=Выборка.Ссылка;
			АвтомобильОбъект=АвтомобильСсылка.ПолучитьОбъект();
			ГосНомер=Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(АвтомобильСсылка,Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
			АвтомобильОбъект.ФормированиеНаименованияАвтомобиля(ГосНомер,"НаименованиеПолное");
			Если АвтомобильОбъект.Модифицированность() Тогда
				АвтомобильОбъект.ОбменДанными.Загрузка=Истина;
				Попытка
					АвтомобильОбъект.Записать();
					Сообщить("Обновлено полное наименование автомобиля <"+АвтомобильСсылка+">.");
				Исключение
					Сообщить("Ошибка обновления полного наименования автомобиля <"+АвтомобильСсылка+">: "+ОписаниеОшибки());
				КонецПопытки; 
			КонецЕсли; 
		КонецЦикла;
		Сообщить("Обновление справочника ""Автомобили"" завершено.");
	КонецЕсли; 
КонецПроцедуры

// Обновление до 5.0.07.02
//
Процедура ОбновитьДо_5_0_07_02()
	Справочники.ДополнительныеКодыAudatex.ЗаполнитьИзМакета();
КонецПроцедуры

// Обновление до 5.0.07.03
//
Процедура ОбновитьДо_5_0_07_03()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДенежныеСредстваКомпании.Период КАК Период,
	|	ДенежныеСредстваКомпании.Регистратор,
	|	ВЫБОР
	|		КОГДА ДенежныеСредстваКомпании.Регистратор ССЫЛКА Документ.Выписка ТОГДА
	|			1
	|		КОГДА ДенежныеСредстваКомпании.Регистратор ССЫЛКА Документ.ВыплатаЗарплаты ТОГДА
	|			2
	|		КОГДА ДенежныеСредстваКомпании.Регистратор ССЫЛКА Документ.ПеремещениеДенежныхСредств ТОГДА
	|			3
	|		КОГДА ДенежныеСредстваКомпании.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер ТОГДА
	|			4
	|		КОГДА ДенежныеСредстваКомпании.Регистратор ССЫЛКА Документ.РасходныйКассовыйОрдер ТОГДА
	|			5
	|	КОНЕЦ КАК ВидДокумента
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваКомпании КАК ДенежныеСредстваКомпании
	|ГДЕ
	|	ДенежныеСредстваКомпании.Регистратор ССЫЛКА Документ.Выписка ИЛИ 
	|	ДенежныеСредстваКомпании.Регистратор ССЫЛКА Документ.ВыплатаЗарплаты ИЛИ 
	|	ДенежныеСредстваКомпании.Регистратор ССЫЛКА Документ.ПеремещениеДенежныхСредств ИЛИ 
	|	ДенежныеСредстваКомпании.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер ИЛИ 
	|	ДенежныеСредстваКомпании.Регистратор ССЫЛКА Документ.РасходныйКассовыйОрдер
	|";
	
	РежимПроведения = РежимПроведенияДокумента.Неоперативный;
	НаборЗаписей = РегистрыНакопления.ПлатежныйКалендарь.СоздатьНаборЗаписей();
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Сообщить("Обновление регистра ""Платежный календарь""");
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		
		//НаборЗаписей = Движения.ПлатежныйКалендарь;
		НаборЗаписей.ДокументОбъект  = Выборка.Регистратор;
		
		Если Выборка.ВидДокумента = 1 Тогда
			Отказ = Не НаборЗаписей.ФактВыписка();
		ИначеЕсли Выборка.ВидДокумента = 2 Тогда
			Отказ = Не НаборЗаписей.ФактВыплата();
		ИначеЕсли Выборка.ВидДокумента = 3 Тогда
			Отказ = Не НаборЗаписей.ФактПеремещение() ИЛИ Отказ;
		ИначеЕсли Выборка.ВидДокумента = 4 Тогда
			НаборЗаписей.Поступление = Истина;
			Отказ = Не НаборЗаписей.Факт();
		ИначеЕсли Выборка.ВидДокумента = 5 Тогда
			НаборЗаписей.Поступление = Ложь;
			Отказ = Не НаборЗаписей.Факт();
		КонецЕсли;
		
		Для Каждого ТекСтрока Из НаборЗаписей Цикл
			ТекСтрока.Период = Выборка.Период;
		КонецЦикла;
		
		Попытка
			Если Не Отказ Тогда
				НаборЗаписей.ОбменДанными.Загрузка = Истина;
				НаборЗаписей.Записать(Истина);
				НаборЗаписей.ОбменДанными.Загрузка = Ложь;
			КонецЕсли;
		Исключение
				Сообщить("Ошибка обновления регистра ""Платежный календарь"" "+ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
	Сообщить("Обновление регистра ""Платежный календарь"" завершено.");
	
КонецПроцедуры

// Обновление до 5.0.08.04
//
Процедура ОбновитьДо_5_0_08_04()
	
	ХранилищаНастроек.ХранилищеВариантовОтчетов.ОбновитьВариантыОтчетов();
	
КонецПроцедуры

// Обновление до 5.0.10.02
//
Процедура ОбновитьДо_5_0_10_02()
	
	//Обновление ДатаНачалаДействия
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ИзменениеЦенАвтомобилей.Ссылка КАК ИзменениеЦенАвтомобилей,
	             |	ИзменениеЦенАвтомобилей.Представление
	             |ИЗ
	             |	Документ.ИзменениеЦенАвтомобилей КАК ИзменениеЦенАвтомобилей
	             |ГДЕ
	             |	ИзменениеЦенАвтомобилей.ДатаНачалаДействия = &ДатаНачалаДействия";
	Запрос.УстановитьПараметр("ДатаНачалаДействия",Дата('00010101'));
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Количество()>0 Тогда
		Сообщить("Обновление даты начала действия цены");
		Пока Выборка.Следующий() Цикл
			ИзменениеЦенАвтомобилейОбъект = Выборка.ИзменениеЦенАвтомобилей.ПолучитьОбъект();
			ИзменениеЦенАвтомобилейОбъект.ДатаНачалаДействия = ИзменениеЦенАвтомобилейОбъект.Дата;
			
			ИзменениеЦенАвтомобилейОбъект.ОбменДанными.Загрузка = Истина;
			Попытка
				ИзменениеЦенАвтомобилейОбъект.Записать();
				Сообщить("Обновление изменения цен автомобиля <"+Выборка.Представление+">.");
			Исключение
				Сообщить("Ошибка обновления изменения цен автомобиля <"+Выборка.Представление+">: "+ОписаниеОшибки());
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;
	
	//Обновление ДатаНачалаДействия
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ИзменениеЦенОпций.Ссылка КАК ИзменениеЦенОпций,
	             |	ИзменениеЦенОпций.Представление
	             |ИЗ
	             |	Документ.ИзменениеЦенОпций КАК ИзменениеЦенОпций
	             |ГДЕ
	             |	ИзменениеЦенОпций.ДатаНачалаДействия = &ДатаНачалаДействия";
	Запрос.УстановитьПараметр("ДатаНачалаДействия",Дата('00010101'));
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Количество()>0 Тогда
		Сообщить("Обновление даты начала действия цены");
		Пока Выборка.Следующий() Цикл
			ИзменениеЦенОпцийОбъект = Выборка.ИзменениеЦенОпций.ПолучитьОбъект();
			ИзменениеЦенОпцийОбъект.ДатаНачалаДействия = ИзменениеЦенОпцийОбъект.Дата;
			
			ИзменениеЦенОпцийОбъект.ОбменДанными.Загрузка = Истина;
			Попытка
				ИзменениеЦенОпцийОбъект.Записать();
				Сообщить("Обновление изменения цен автомобиля <"+Выборка.Представление+">.");
			Исключение
				Сообщить("Ошибка обновления изменения цен автомобиля <"+Выборка.Представление+">: "+ОписаниеОшибки());
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;
	
	Сообщить("Обновление справочника ""Варианты отчетов""");
	
	КлючОтчета = Метаданные.Отчеты.ЗагрузкаРесурсовАвтосервиса.ПолноеИмя();
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВариантыОтчетов.КлючВарианта КАК КлючВарианта,
	               |	ВариантыОтчетов.Ссылка
	               |ИЗ
	               |	Справочник.ВариантыОтчетов КАК ВариантыОтчетов
	               |ГДЕ
	               |	ВариантыОтчетов.КлючОтчета = &КлючОтчета
	               |	И ВариантыОтчетов.ПометкаУдаления = ЛОЖЬ
	               |	И ВариантыОтчетов.ЭтоПредопределенный";
	Запрос.УстановитьПараметр("КлючОтчета", КлючОтчета);
	ТаблицаВариантов = Запрос.Выполнить().Выгрузить();
	Если ТаблицаВариантов.Количество()>0 Тогда
		МассивИсключений = ТаблицаВариантов.ВыгрузитьКолонку("КлючВарианта");
	КонецЕсли;
	
	Отчеты.ЗагрузкаРесурсовАвтосервиса.СоздатьВариантыОтчета(КлючОтчета, МассивИсключений);
	
	Отчеты.ЗагрузкаРесурсовАвтосервиса.ОбновитьПризнакПредопределенногоУВариантовОтчета(КлючОтчета, ТаблицаВариантов);
	
	Сообщить("Обновление справочника ""Варианты отчетов"" завершено.");
	
	
КонецПроцедуры

//Выводит описание изменений для соответствующего номера релиза
//из МакетаОбновлений в ДокументОбновлений
//Зарезервировано на будущее
Процедура ВывестиОписаниеИзменений(НомерРелиза, ДокументОбновлений, МакетОбновлений)
	ДокументОбновлений.Вывести(МакетОбновлений.ПолучитьОбласть("Шапка" + НомерРелиза));
	ДокументОбновлений.НачатьГруппуСтрок("Релиз" + НомерРелиза);
	ДокументОбновлений.Вывести(МакетОбновлений.ПолучитьОбласть("Релиз" + НомерРелиза));
	ДокументОбновлений.ЗакончитьГруппуСтрок();
КонецПроцедуры

#КонецЕсли
